Repository: fenghlkevin/reqeast
Catalog: Reqeast/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, zh_hans, zh_hant

source: This integration supports Java and common Spring web annotations. Kotlin, custom annotation aliases, wildcard or regex paths, and runtime path expressions need manual configuration. Inherited parameter annotations and mapping conditions require review. DTO nesting is limited to 8 levels and 100 fields per type; exports are limited to 2000 interfaces and 5 MB. If no preview opens, check that RHEQ is installed in /Applications and inspect the error in IDEA.
de: Java und übliche Spring-Web-Annotationen werden unterstützt. Kotlin, eigene Aliase, Platzhalter-, Regex- und dynamische Pfade müssen manuell konfiguriert werden. Prüfen Sie geerbte Parameterannotationen und Bedingungen. Grenzen: 8 DTO-Ebenen, 100 Felder pro Typ, 2000 Schnittstellen und 5 MB. Falls keine Vorschau erscheint, prüfen Sie RHEQ in /Applications und den IDEA-Fehler.
es: Admite Java y anotaciones Spring Web comunes. Kotlin, alias personalizados, rutas con comodines, regex o expresiones dinámicas requieren configuración manual. Revisa anotaciones heredadas y condiciones. Límites: DTO de 8 niveles, 100 campos por tipo, 2000 interfaces y 5 MB. Si no se abre la vista previa, comprueba RHEQ en /Applications y el error de IDEA.
fr: Java et les annotations Spring Web courantes sont pris en charge. Kotlin, alias personnalisés, chemins à jokers, regex ou expressions dynamiques nécessitent une configuration manuelle. Vérifiez les annotations héritées et conditions de mapping. Limites : DTO sur 8 niveaux, 100 champs par type, 2000 interfaces et 5 Mo. Si rien ne s’ouvre, vérifiez RHEQ dans /Applications et l’erreur IDEA.
ja: Java と一般的な Spring Web 注釈に対応します。Kotlin、独自注釈、ワイルドカード・正規表現・実行時のパスは手動設定が必要です。継承した引数注釈とマッピング条件も確認してください。DTO は 8 階層、型ごとに 100 フィールド、書き出しは 2000 件・5 MB までです。開かない場合は /Applications の RHEQ と IDEA のエラーを確認します。
ko: Java와 일반적인 Spring Web 어노테이션을 지원합니다. Kotlin, 사용자 정의 별칭, 와일드카드·정규식·동적 경로는 수동 설정이 필요합니다. 상속한 매개변수 어노테이션과 매핑 조건을 검토하세요. DTO는 8단계, 타입별 100필드, 내보내기는 2000개와 5 MB까지입니다. 미리보기가 안 열리면 /Applications의 RHEQ와 IDEA 오류를 확인하세요.
pt_br: Suporta Java e anotações Spring Web comuns. Kotlin, aliases personalizados, caminhos com curingas, regex ou expressões dinâmicas exigem configuração manual. Revise anotações herdadas e condições de mapeamento. Limites: 8 níveis DTO, 100 campos por tipo, 2000 interfaces e 5 MB. Se a prévia não abrir, confira RHEQ em /Applications e o erro no IDEA.
zh_hans: 支持 Java 和常见 Spring Web 注解。Kotlin、自定义注解别名、通配符或正则路径及运行时路径表达式需要手动配置。继承参数注解和映射条件需要核对。DTO 最多 8 层、每种类型 100 个字段；每次最多 2000 个接口、5 MB。预览未打开时，请检查 /Applications 中的 RHEQ，并查看 IDEA 报错。
zh_hant: 支援 Java 及常見 Spring Web 註解。Kotlin、自訂註解別名、萬用字元或正規表示式路徑及執行時期路徑需手動設定。繼承參數註解及對應條件需核對。DTO 最多 8 層、每類型 100 欄位；匯出最多 2000 介面、5 MB。無法開啟預覽時請檢查 /Applications 中的 RHEQ 及 IDEA 錯誤。

source: Import using the method icon
de: Über das Methodensymbol importieren
es: Importar con el icono del método
fr: Importer avec l’icône de la méthode
ja: メソッドのアイコンから読み込む
ko: 메서드 아이콘으로 가져오기
pt_br: Importar pelo ícone do método
zh_hans: 点击方法图标导入
zh_hant: 點擊方法圖示匯入

source: Import this interface into RHEQ
de: Diese Schnittstelle in RHEQ importieren
es: Importar esta interfaz en RHEQ
fr: Importer cette interface dans RHEQ
ja: このインターフェースを RHEQ に読み込む
ko: 이 인터페이스를 RHEQ로 가져오기
pt_br: Importar esta interface no RHEQ
zh_hans: 导入此接口到 RHEQ
zh_hant: 匯入此介面至 RHEQ

source: Click the RHEQ icon beside the method to import only that interface.
de: Klicken Sie auf das RHEQ-Symbol neben der Methode, um nur diese Schnittstelle zu importieren.
es: Haz clic en el icono RHEQ junto al método para importar solo esa interfaz.
fr: Cliquez sur l’icône RHEQ à côté de la méthode pour importer uniquement cette interface.
ja: メソッドの横にある RHEQ アイコンをクリックすると、そのインターフェースだけを読み込みます。
ko: 메서드 옆 RHEQ 아이콘을 클릭하면 해당 인터페이스만 가져옵니다.
pt_br: Clique no ícone RHEQ ao lado do método para importar somente essa interface.
zh_hans: 点击方法左侧的 RHEQ 图标，仅导入该接口。
zh_hant: 點擊方法左側的 RHEQ 圖示，僅匯入該介面。

source: Illustration of the method import icon. Click to enlarge.
de: Darstellung des Methodensymbols für den Import. Zum Vergrößern klicken.
es: Ilustración del icono de importación de método. Haz clic para ampliar.
fr: Illustration de l’icône d’importation de méthode. Cliquez pour agrandir.
ja: メソッド読み込みアイコンの位置を示す図です。クリックすると拡大します。
ko: 메서드 가져오기 아이콘 위치 안내 그림입니다. 클릭하여 확대하세요.
pt_br: Ilustração do ícone de importação de método. Clique para ampliar.
zh_hans: 方法导入图标的位置示意。点击放大。
zh_hant: 方法匯入圖示的位置示意。點擊放大。

source: After IDEA indexing finishes, a RHEQ icon appears in the left gutter beside each supported Controller method. Hover over it to see Import this interface into RHEQ, then click the icon. Only that method is exported, regardless of the caret position. Enter the base URL and continue to the RHEQ preview. If the icon is hidden, open IDEA Settings → Editor → General → Gutter Icons and enable RHEQ Interface Import.
de: Nach der IDEA-Indizierung erscheint links neben jeder unterstützten Controller-Methode ein RHEQ-Symbol. Bewegen Sie den Mauszeiger darüber und klicken Sie darauf. Unabhängig von der Cursorposition wird nur diese Methode exportiert. Geben Sie die Basis-URL ein und öffnen Sie die RHEQ-Vorschau. Falls das Symbol fehlt, aktivieren Sie RHEQ Interface Import unter Settings → Editor → General → Gutter Icons.
es: Al terminar la indexación de IDEA, aparece un icono RHEQ en el margen izquierdo de cada método Controller compatible. Pasa el puntero para ver la acción y haz clic. Solo se exporta ese método, independientemente de la posición del cursor. Introduce la URL base y abre la vista previa de RHEQ. Si está oculto, activa RHEQ Interface Import en Settings → Editor → General → Gutter Icons.
fr: Après l’indexation IDEA, une icône RHEQ apparaît dans la marge gauche de chaque méthode Controller prise en charge. Survolez-la pour voir l’action, puis cliquez. Seule cette méthode est exportée, quelle que soit la position du curseur. Saisissez l’URL de base et ouvrez l’aperçu RHEQ. Si l’icône est masquée, activez RHEQ Interface Import dans Settings → Editor → General → Gutter Icons.
ja: IDEA のインデックス作成完了後、対応する Controller メソッドの左側に RHEQ アイコンが表示されます。カーソルを重ねると読み込みの説明が出ます。クリックすると、エディター内のカーソル位置に関係なくそのメソッドだけを書き出します。ベース URL を入力し、RHEQ のプレビューに進みます。非表示の場合は IDEA の Settings → Editor → General → Gutter Icons で RHEQ Interface Import を有効にしてください。
ko: IDEA 색인이 완료되면 지원하는 Controller 메서드 왼쪽에 RHEQ 아이콘이 표시됩니다. 포인터를 올려 동작을 확인한 뒤 클릭합니다. 커서 위치와 관계없이 해당 메서드만 내보냅니다. 기본 URL을 입력하여 RHEQ 미리보기를 엽니다. 아이콘이 숨겨져 있으면 Settings → Editor → General → Gutter Icons에서 RHEQ Interface Import를 활성화하세요.
pt_br: Após a indexação do IDEA, um ícone RHEQ aparece na margem esquerda de cada método Controller suportado. Passe o mouse para ver a ação e clique. Somente esse método é exportado, independentemente da posição do cursor. Informe a URL base e abra a prévia do RHEQ. Se o ícone estiver oculto, ative RHEQ Interface Import em Settings → Editor → General → Gutter Icons.
zh_hans: IDEA 索引完成后，每个支持的 Controller 方法左侧会出现 RHEQ 图标。悬停显示「导入此接口到 RHEQ」，点击即可导入。只导出图标所在的方法，不受光标位置影响。填写基础地址后进入 RHEQ 预览。图标未显示时，在 IDEA Settings → Editor → General → Gutter Icons 中启用 RHEQ Interface Import（RHEQ 接口导入）。
zh_hant: IDEA 索引完成後，每個支援的 Controller 方法左側會顯示 RHEQ 圖示。懸停顯示「匯入此介面至 RHEQ」，點擊即可匯入。僅匯出該方法，不受游標位置影響。填入基礎位址後進入 RHEQ 預覽。圖示未顯示時，在 IDEA Settings → Editor → General → Gutter Icons 中啟用 RHEQ Interface Import。

source: 1 operation
es: 1 operación
fr: 1 opération
ja: 1 件のオペレーション
ko: 오퍼레이션 1개
pt_br: 1 operação
zh_hans: 1 个操作
zh_hant: 1 個操作

source: Array index
es: Índice del array
fr: Index de tableau
ja: 配列インデックス
ko: 배열 인덱스
pt_br: Índice do array
zh_hans: 数组索引
zh_hant: 陣列索引

source: Auth
es: Autenticación
ja: 認証
ko: 인증
pt_br: Autenticação
zh_hans: 认证
zh_hant: 認證

source: Auth Tab
es: Pestaña Auth
fr: Onglet Auth
ja: 認証タブ
ko: 인증 탭
pt_br: Aba Auth
zh_hans: 认证标签页
zh_hant: 認證標籤頁

source: Auto Ping
es: Ping automático
fr: Ping automatique
ja: 自動 Ping
ko: 자동 Ping
pt_br: Ping automático
zh_hans: 自动 Ping
zh_hant: 自動 Ping

source: Body Tab
es: Pestaña Cuerpo
fr: Onglet Corps
ja: ボディタブ
ko: 본문 탭
pt_br: Aba Body
zh_hans: 正文标签页
zh_hant: 主體標籤頁

source: Bundle name
es: Nombre del paquete
fr: Nom du bundle
ja: バンドル名
ko: 번들 이름
pt_br: Nome do pacote
zh_hans: 包名称
zh_hant: 套件名稱

source: Cookie Manager
es: Gestor de cookies
fr: Gestionnaire de cookies
ja: Cookie マネージャー
ko: 쿠키 관리자
pt_br: Gerenciador de cookies
zh_hans: Cookie 管理器
zh_hant: Cookie 管理員

source: Download
es: Descarga
fr: Téléchargement
ja: ダウンロード
ko: 다운로드
zh_hans: 下载
zh_hant: 下載

source: Export format
es: Formato de exportación
fr: Format d'exportation
ja: エクスポート形式
ko: 보내기 형식
pt_br: Formato de exportação
zh_hans: 导出格式
zh_hant: 匯出格式

source: Format
es: Formato
ja: フォーマット
ko: 포맷
pt_br: Formato
zh_hans: 格式
zh_hant: 格式

source: Header
es: Cabecera
fr: En-tête
ja: ヘッダー
ko: 헤더
pt_br: Cabeçalho
zh_hans: 标头
zh_hant: 標頭

source: Header Name
es: Nombre de la cabecera
fr: Nom de l'en-tête
ja: ヘッダー名
ko: 헤더 이름
pt_br: Nome do cabeçalho
zh_hans: 标头名称
zh_hant: 標頭名稱

source: HTTP Version
es: Versión HTTP
fr: Version HTTP
ja: HTTP バージョン
ko: HTTP 버전
pt_br: Versão HTTP
zh_hans: HTTP 版本
zh_hant: HTTP 版本

source: MCP Server
es: Servidor MCP
fr: Serveur MCP
ja: MCP サーバー
ko: MCP 서버
pt_br: Servidor MCP
zh_hans: MCP 服务器
zh_hant: MCP 伺服器

source: Name
es: Nombre
fr: Nom
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称
zh_hant: 名稱

source: OpenAPI format
es: Formato OpenAPI
fr: Format OpenAPI
ja: OpenAPI 形式
ko: OpenAPI 형식
pt_br: Formato OpenAPI
zh_hans: OpenAPI 格式
zh_hant: OpenAPI 格式

source: Optional
es: Opcional
fr: Optionnel
ja: 任意
ko: 선택사항
pt_br: Opcional
zh_hans: 可选
zh_hant: 選填

source: Orange
es: Naranja
ja: オレンジ
ko: 주황색
pt_br: Laranja
zh_hans: 橙色
zh_hant: 橘色

source: Port
es: Puerto
ja: ポート
ko: 포트
pt_br: Porta
zh_hans: 端口
zh_hant: 連接埠

source: Proto bundle
es: Paquete proto
fr: Bundle proto
ja: Proto バンドル
ko: Proto 번들
pt_br: Pacote proto
zh_hans: Proto 包
zh_hant: Proto 套件

source: Proto Bundle
es: Paquete proto
fr: Bundle proto
ja: Proto バンドル
ko: Proto 번들
pt_br: Pacote proto
zh_hans: Proto 包
zh_hant: Proto 套件

source: Region
es: Región
fr: Région
ja: リージョン
ko: 리전
pt_br: Região
zh_hans: 区域
zh_hant: 區域

source: Remote
es: Remoto
fr: Distant
ja: リモート
ko: 원격
pt_br: Remoto
zh_hans: 远程
zh_hant: 遠端

source: Revision
es: Revisión
fr: Révision
ja: リビジョン
ko: 리비전
pt_br: Revisão
zh_hans: 修订版本
zh_hant: 修訂版本

source: Schema
es: Esquema
fr: Schéma
ja: スキーマ
ko: 스키마
pt_br: Esquema
zh_hans: 架构
zh_hant: 架構

source: Server
es: Servidor
fr: Serveur
ja: サーバー
ko: 서버
pt_br: Servidor
zh_hans: 服务器
zh_hant: 伺服器

source: Server reflection
es: Reflexión del servidor
fr: Réflexion serveur
ja: サーバーリフレクション
ko: 서버 리플렉션
pt_br: Reflexão do servidor
zh_hans: 服务器反射
zh_hant: 伺服器反射

source: Spec
es: Especificación
fr: Spécification
ja: 仕様
ko: 사양
pt_br: Especificação
zh_hans: 规范
zh_hant: 規格

source: Spec URL
es: URL de especificación
fr: URL de la spécification
ja: 仕様 URL
ko: 사양 URL
pt_br: URL da especificação
zh_hans: 规范 URL
zh_hant: 規格 URL

source: Specs (%lld)
es: Especificaciones (%lld)
fr: Spécifications (%lld)
ja: 仕様（%lld）
ko: 사양(%lld)
pt_br: Especificações (%lld)
zh_hans: 规范（%lld）
zh_hant: 規格（%lld）

source: Status
es: Estado
fr: Statut
ja: ステータス
ko: 상태
zh_hans: 状态
zh_hant: 狀態

source: Status %lld %@
es: Estado %lld %@
fr: Statut %lld %@
ja: ステータス %lld %@
ko: 상태 %lld %@
zh_hans: 状态 %lld %@
zh_hant: 狀態 %lld %@

source: Tags
es: Etiquetas
ja: タグ
ko: 태그
zh_hans: 标签
zh_hant: 標籤

source: Text
es: Texto
fr: Texte
ja: テキスト
ko: 텍스트
pt_br: Texto
zh_hans: 文本
zh_hant: 文字

source: Timing
es: Duración
fr: Durée
ja: タイミング
ko: 타이밍
pt_br: Tempo
zh_hans: 耗时
zh_hant: 耗時

# Version %@ (%@)
source: Version %1$@ (%2$@)
es: Versión %1$@ (%2$@)
ja: バージョン %1$@ (%2$@)
ko: 버전 %1$@ (%2$@)
pt_br: Versão %1$@ (%2$@)
zh_hans: 版本 %1$@ (%2$@)
zh_hant: 版本 %1$@ (%2$@)

source: IDEA Integration
es: Integración con IDEA
fr: Intégration IDEA
ja: IDEA 連携
ko: IDEA 연동
pt_br: Integração com IDEA
zh_hans: IDEA 集成
zh_hant: IDEA 整合

source: Editor
fr: Éditeur
ja: エディタ
ko: 편집기
zh_hans: 编辑器
zh_hant: 編輯器

source: Form Data
fr: Données de formulaire
ja: フォームデータ
zh_hans: 表单数据
zh_hant: 表單資料

source: Host
fr: Hote
ja: ホスト
ko: 호스트
zh_hans: 主机
zh_hant: 主機

source: Info
fr: Infos
ja: 情報
ko: 정보
pt_br: Informações
zh_hans: 信息
zh_hant: 資訊

source: Raw
fr: Brut
pt_br: Puro
zh_hans: 原始
zh_hant: 原始

source: Token
fr: Jeton
ja: トークン
ko: 토큰
zh_hans: 令牌
zh_hant: 權杖

source: %lld cookies
ja: %lld 個の Cookie
ko: %lld개 쿠키
zh_hans: %lld 个 Cookie
zh_hant: %lld 個 Cookie

source: %llds
ja: %lld 秒
ko: %lld초
zh_hans: %lld 秒
zh_hant: %lld 秒

source: Auto
ja: 自動
ko: 자동
zh_hans: 自动
zh_hant: 自動

source: Cookies
ja: Cookie
ko: 쿠키

source: Debug
ja: デバッグ
ko: 디버그
zh_hans: 调试
zh_hant: 除錯

source: Payload (JSON)
ja: ペイロード (JSON)

source: Variable
ja: 変数
ko: 변수
pt_br: Variável
zh_hans: 变量
zh_hant: 變數
